In [2]:
# https://dplyr.tidyverse.org/reference/mutate.html
from plyrda.data import starwars
from plyrda.all import *

In [3]:
starwars >> \
 select(f.name, f.mass) >> \
 mutate(
  mass2 = f.mass * 2,
  mass2_squared = f.mass2 * f.mass2
)

              name   mass  mass2  mass2_squared
0   Luke Skywalker   77.0  154.0        23716.0
1            C-3PO   75.0  150.0        22500.0
2            R2-D2   32.0   64.0         4096.0
3      Darth Vader  136.0  272.0        73984.0
4      Leia Organa   49.0   98.0         9604.0
..             ...    ...    ...            ...
82             Rey    NaN    NaN            NaN
83     Poe Dameron    NaN    NaN            NaN
84             BB8    NaN    NaN            NaN
85  Captain Phasma    NaN    NaN            NaN
86   Padmé Amidala   45.0   90.0         8100.0

[87 rows x 4 columns]

In [5]:
starwars >> \
 select(f.name, f.height, f.mass, f.homeworld) >> \
 mutate(
  mass = None,
  height = f.height * 0.0328084 # convert to feet
)

              name    height homeworld
0   Luke Skywalker  5.643045  Tatooine
1            C-3PO  5.479003  Tatooine
2            R2-D2  3.149606     Naboo
3      Darth Vader  6.627297  Tatooine
4      Leia Organa  4.921260  Alderaan
..             ...       ...       ...
82             Rey       NaN       NaN
83     Poe Dameron       NaN       NaN
84             BB8       NaN       NaN
85  Captain Phasma       NaN       NaN
86   Padmé Amidala  5.413386     Naboo

[87 rows x 3 columns]

In [7]:
x = starwars >> \
 select(f.name, f.homeworld, f.species) >> \
 mutate(across(-f.name, as_categorical))

print(x.dtypes)
x

name           object
homeworld    category
species      category
dtype: object

              name homeworld species
0   Luke Skywalker  Tatooine   Human
1            C-3PO  Tatooine   Droid
2            R2-D2     Naboo   Droid
3      Darth Vader  Tatooine   Human
4      Leia Organa  Alderaan   Human
..             ...       ...     ...
82             Rey       NaN   Human
83     Poe Dameron       NaN   Human
84             BB8       NaN   Droid
85  Captain Phasma       NaN     NaN
86   Padmé Amidala     Naboo   Human

[87 rows x 3 columns]

In [ ]:
starwars >> \
 select(f.name, f.mass, f.homeworld) >> \
 group_by(f.homeworld) %>%
 mutate(rank=min_rank(desc(f.mass)))